; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v2 ?v13)
             (pred_1 ?v8 ?v1)
             (pred_6 ?v2 ?v1)
             (pred_9 ?v12 ?v2 )
	     (pred_11 ?v2)
             (pred_12 ?v10)
             (pred_4 ?v8)
             (pred_8 ?v1)
             (pred_7 ?v2)
             (pred_2 ?v8)
             (pred_3 ?v2)
             (pred_10 ))



(:action op_3
:parameters (?v9 ?v11 ?v6 ?v7)
:precondition (and (pred_12 ?v9) (pred_12 ?v11) (pred_4 ?v6) (pred_8 ?v7)
          (pred_5 ?v9 ?v11) (pred_1 ?v6 ?v7)
                   (pred_6 ?v11 ?v7) (pred_11 ?v9) 
                   (pred_7 ?v11) (pred_2 ?v6))
:effect (and  (pred_3 ?v11) (not (pred_7 ?v11))))


(:action op_1
:parameters (?v9 ?v4)
:precondition (and (pred_12 ?v9) (pred_12 ?v4)
               (pred_11 ?v9) (pred_5 ?v9 ?v4) (pred_3 ?v4))
:effect (and (pred_11 ?v4) (not (pred_11 ?v9))))

(:action op_4
:parameters (?v9 ?v6)
:precondition (and (pred_12 ?v9) (pred_4 ?v6) 
                  (pred_11 ?v9) (pred_9 ?v6 ?v9) (pred_10 ))
:effect (and (pred_2 ?v6)
   (not (pred_9 ?v6 ?v9)) (not (pred_10 ))))


(:action op_5
:parameters (?v9 ?v3 ?v5)
:precondition (and (pred_12 ?v9) (pred_4 ?v3) (pred_4 ?v5)
                  (pred_11 ?v9) (pred_2 ?v5) (pred_9 ?v3 ?v9))
:effect (and (pred_2 ?v3) (pred_9 ?v5 ?v9)
        (not (pred_2 ?v5)) (not (pred_9 ?v3 ?v9))))

(:action op_2
:parameters (?v9 ?v6)
:precondition (and (pred_12 ?v9) (pred_4 ?v6) 
                  (pred_11 ?v9) (pred_2 ?v6))
:effect (and (pred_10 ) (pred_9 ?v6 ?v9) (not (pred_2 ?v6)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_09 obj_10 obj_07 obj_02 obj_03 obj_17 obj_05 obj_15 obj_01 obj_12 obj_19 obj_18 obj_04 obj_21 obj_11 obj_13
    obj_08 obj_06
    obj_16 obj_20 obj_14
    )

    (:init
       (pred_10)

       (pred_12 obj_09)
       (pred_12 obj_10)
       (pred_12 obj_07)
       (pred_12 obj_02)
       (pred_12 obj_03)
       (pred_12 obj_17)
       (pred_12 obj_05)
       (pred_12 obj_15)
       (pred_12 obj_01)
       (pred_12 obj_12)
       (pred_12 obj_19)
       (pred_12 obj_18)
       (pred_12 obj_04)
       (pred_12 obj_21)
       (pred_12 obj_11)
       (pred_12 obj_13)
       (pred_8 obj_08)
       (pred_8 obj_06)
       (pred_4 obj_16)
       (pred_4 obj_20)
       (pred_4 obj_14)

       (pred_5 obj_09 obj_03)
       (pred_5 obj_09 obj_10)
       (pred_5 obj_10 obj_17)
       (pred_5 obj_10 obj_07)
       (pred_5 obj_10 obj_09)
       (pred_5 obj_07 obj_05)
       (pred_5 obj_07 obj_02)
       (pred_5 obj_07 obj_10)
       (pred_5 obj_02 obj_15)
       (pred_5 obj_02 obj_07)
       (pred_5 obj_03 obj_01)
       (pred_5 obj_03 obj_17)
       (pred_5 obj_03 obj_09)
       (pred_5 obj_17 obj_12)
       (pred_5 obj_17 obj_05)
       (pred_5 obj_17 obj_10)
       (pred_5 obj_17 obj_03)
       (pred_5 obj_05 obj_19)
       (pred_5 obj_05 obj_15)
       (pred_5 obj_05 obj_07)
       (pred_5 obj_05 obj_17)
       (pred_5 obj_15 obj_18)
       (pred_5 obj_15 obj_02)
       (pred_5 obj_15 obj_05)
       (pred_5 obj_01 obj_04)
       (pred_5 obj_01 obj_12)
       (pred_5 obj_01 obj_03)
       (pred_5 obj_12 obj_21)
       (pred_5 obj_12 obj_19)
       (pred_5 obj_12 obj_17)
       (pred_5 obj_12 obj_01)
       (pred_5 obj_19 obj_11)
       (pred_5 obj_19 obj_18)
       (pred_5 obj_19 obj_05)
       (pred_5 obj_19 obj_12)
       (pred_5 obj_18 obj_13)
       (pred_5 obj_18 obj_15)
       (pred_5 obj_18 obj_19)
       (pred_5 obj_04 obj_21)
       (pred_5 obj_04 obj_01)
       (pred_5 obj_21 obj_11)
       (pred_5 obj_21 obj_12)
       (pred_5 obj_21 obj_04)
       (pred_5 obj_11 obj_13)
       (pred_5 obj_11 obj_19)
       (pred_5 obj_11 obj_21)
       (pred_5 obj_13 obj_18)
       (pred_5 obj_13 obj_11)
       (pred_7 obj_04)
       (pred_7 obj_05)
       (pred_7 obj_03)
       (pred_6  obj_04 obj_08)
       (pred_6  obj_05 obj_06)
       (pred_6  obj_03 obj_06)
       (pred_3 obj_09)
       (pred_3 obj_10)
       (pred_3 obj_07)
       (pred_3 obj_02)
       (pred_3 obj_17)
       (pred_3 obj_15)
       (pred_3 obj_01)
       (pred_3 obj_12)
       (pred_3 obj_19)
       (pred_3 obj_18)
       (pred_3 obj_21)
       (pred_3 obj_11)
       (pred_3 obj_13)

       (pred_1  obj_16 obj_08)
       (pred_1  obj_20 obj_06)
       (pred_1  obj_14 obj_06)
       (pred_9 obj_16 obj_01)
       (pred_9 obj_20 obj_02)
       (pred_9 obj_14 obj_01)
       (pred_11 obj_02)
    )

    (:goal (and
       (pred_9 obj_16 obj_15)
       (pred_9 obj_14 obj_07)
    ))
(:constraints
  (always (not (pred_11 obj_17)))
)
)

; plan
1. (op_4 obj_02 obj_20)
   deleted: (pred_9 obj_20 obj_02) (pred_10)
   added: (pred_2 obj_20)
   goals met: 0 of 2
2. (op_1 obj_02 obj_15)
   deleted: (pred_11 obj_02)
   added: (pred_11 obj_15)
   goals met: 0 of 2
3. (op_3 obj_15 obj_05 obj_20 obj_06)
   deleted: (pred_7 obj_05)
   added: (pred_3 obj_05)
   goals met: 0 of 2
4. (op_2 obj_15 obj_20)
   deleted: (pred_2 obj_20)
   added: (pred_10) (pred_9 obj_20 obj_15)
   goals met: 0 of 2
5. (op_1 obj_15 obj_05)
   deleted: (pred_11 obj_15)
   added: (pred_11 obj_05)
   goals met: 0 of 2
6. (op_1 obj_05 obj_19)
   deleted: (pred_11 obj_05)
   added: (pred_11 obj_19)
   goals met: 0 of 2
7. (op_1 obj_19 obj_12)
   deleted: (pred_11 obj_19)
   added: (pred_11 obj_12)
   goals met: 0 of 2
8. (op_1 obj_12 obj_01)
   deleted: (pred_11 obj_12)
   added: (pred_11 obj_01)
   goals met: 0 of 2
9. (op_4 obj_01 obj_14)
   deleted: (pred_9 obj_14 obj_01) (pred_10)
   added: (pred_2 obj_14)
   goals met: 0 of 2
10. (op_1 obj_01 obj_12)
   deleted: (pred_11 obj_01)
   added: (pred_11 obj_12)
   goals met: 0 of 2
11. (op_1 obj_12 obj_19)
   deleted: (pred_11 obj_12)
   added: (pred_11 obj_19)
   goals met: 0 of 2
12. (op_1 obj_19 obj_05)
   deleted: (pred_11 obj_19)
   added: (pred_11 obj_05)
   goals met: 0 of 2
13. (op_1 obj_05 obj_07)
   deleted: (pred_11 obj_05)
   added: (pred_11 obj_07)
   goals met: 0 of 2
14. (op_2 obj_07 obj_14)
   deleted: (pred_2 obj_14)
   added: (pred_10) (pred_9 obj_14 obj_07)
   goals met: 1 of 2
15. (op_1 obj_07 obj_05)
   deleted: (pred_11 obj_07)
   added: (pred_11 obj_05)
   goals met: 1 of 2
16. (op_1 obj_05 obj_19)
   deleted: (pred_11 obj_05)
   added: (pred_11 obj_19)
   goals met: 1 of 2
17. (op_1 obj_19 obj_12)
   deleted: (pred_11 obj_19)
   added: (pred_11 obj_12)
   goals met: 1 of 2
18. (op_1 obj_12 obj_01)
   deleted: (pred_11 obj_12)
   added: (pred_11 obj_01)
   goals met: 1 of 2
19. (op_4 obj_01 obj_16)
   deleted: (pred_9 obj_16 obj_01) (pred_10)
   added: (pred_2 obj_16)
   goals met: 1 of 2
20. (op_1 obj_01 obj_12)
   deleted: (pred_11 obj_01)
   added: (pred_11 obj_12)
   goals met: 1 of 2
21. (op_1 obj_12 obj_19)
   deleted: (pred_11 obj_12)
   added: (pred_11 obj_19)
   goals met: 1 of 2
22. (op_1 obj_19 obj_05)
   deleted: (pred_11 obj_19)
   added: (pred_11 obj_05)
   goals met: 1 of 2
23. (op_1 obj_05 obj_15)
   deleted: (pred_11 obj_05)
   added: (pred_11 obj_15)
   goals met: 1 of 2
24. (op_5 obj_15 obj_20 obj_16)
   deleted: (pred_2 obj_16) (pred_9 obj_20 obj_15)
   added: (pred_2 obj_20) (pred_9 obj_16 obj_15)
   goals met: 2 of 2
